Revit 2024 API
ParameterTypeId.SpatialFieldMgrCurrentName Property
 "Analysis Configuration"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SpatialFieldMgrCurrentName { get; }
Visual Basic
Public Shared ReadOnly Property SpatialFieldMgrCurrentName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SpatialFieldMgrCurrentName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace